import React from "react";
import axios from "./axios";

export default class Welcome extends React.Component {
    constructor(props) {
        super(props);
        this.state = {};
    }
    componentDidMount() {
        axios.get("/getbigfile").then(data => {
            console.log({ data }, "this data");
            this.setState({
                bigfile: data.data.bigfiles
            });
        });
    }

    render() {


        return (
            <div>
                <div id="titleofpage">
                    <h1>Orphei hymnorum epitheta</h1>
                </div>
                <div id="textholderdiv">
                    <span>
                        ΟΡΦΕΥΣ ΠΡΟΣ ΜΟΥΣΑΙΟΝ
                        <br />
                        <br />

                    </span>

                    <span>Εὐτυχῶς χρῶ, ἑταῖρε.<br />
                        <br /></span>

                    <span>Μάνθανε δή, Μουσαῖε, θυηπολίην περισέμνην,<br /></span>
                    <span>εὐχήν, ἣ δή τοι προφερεστέρη ἐστὶν ἁπασέων.<br /></span>
                    <span>Ζεῦ βασιλεῦ καὶ Γαῖα καὶ οὐράνιαι φλόγες ἁγναὶ<br /></span>
                        <span>Ἠελίου, Μήνης θ' ἱερὸν σέλας Ἄστρα τε πάντα<br /></span>
                    <span>καὶ σύ, Ποσείδαον γαιήοχε, κυανοχαῖτα,<br /></span>
                    <span>Φερσεφόνη θ' ἁγνὴ Δημήτηρ τ' ἀγλαόκαρπε<br /></span>
                    <span> Ἄρτεμί τ' ἰοχέαιρα, κόρη, καὶ ἤιε Φοῖβε,<br /></span>
                    <span>ὃς Δελφῶν ναίεις ἱερὸν πέδον· ὅς τε μεγίστας<br /></span>
                    <span>τιμὰς ἐν μακάρεσσιν ἔχεις, Διόνυσε χορευτά·<br /></span>
                <span> Ἆρές τ' ὀμβριμόθυμε καὶ Ἡφαίστου μένος ἁγνὸν<br /></span>
                <span>ἀφρογενής τε θεά, μεγαλώνυμα δῶρα λαχοῦσα·<br /></span>
                    <span>καὶ σύ, καταχθονίων βασιλεῦ, μέγ'  ίροχε δαῖμον,<br /></span>
                <span> Ἥβη τ' Εἰλείθυια καὶ Ἡρακλέος μένος ἠύ·<br /></span>
                <span>καὶ τὸ Δικαιοσύνης τε καὶ Εὐσεβίης μέγ' ὄνειαρ<br /></span>
                    <span>κικλήσκω Νύμφας τε κλυτὰς καὶ Πᾶνα μέγιστον<br /></span>
                <span> Ἥρην τ', αἰγιόχοιο Διὸς θαλερὴν παράκοιτιν·<br /></span>
                    <span>Μνημοσύνην τ' ἐρατὴν Μούσας τ'ἐπικέκλομαι ἁγνὰς<br /></span>
                    <span>ἐννέα καὶ Χάριτάς τε καὶ Ὥρας ἠδ' Ἐνιαυτὸν<br /></span>
                    <span>Λητώ τ' εὐπλόκαμον, Θείην σεμνήν τε Διώνην<br /></span>
                    <span>Κουρῆτάς τ' ἐνόπλους Κορύβαντάς τ' ἠδὲ Καβείρους<br /></span>
                    <span>καὶ μεγάλους Σωτῆρας ὁμοῦ, Διὸς ἄφθιτα τέκνα,<br /></span>
                <span> Ἰδαίους τε θεοὺς ἠδ' ἄγγελον Οὐρανιώνων,<br /></span>
                <span> Ἑρμείαν κήρυκα, Θέμιν θ', ἱεροσκόπον ἀνδρῶν,<br /></span>
                    <span>Νύκτα τε πρεσβίστην καλέω καὶ φωσφόρον Ἦμαρ,<br /></span>
                    <span>Πίστιν τ' ἠδὲ Δίκην καὶ ἀμύμονα Θεσμοδότειραν,<br /></span>
                <span> Ῥείαν τ' ἠδὲ Κρόνον καὶ Τηθὺν κυανόπεπλον<br /></span>
                <span> Ὠκεανόν τε μέγαν, σύν τ' Ὠκεανοῖο θύγατρας<br /></span>
                <span> Ἄτλαντός τε καὶ Αἰῶνος μέγ' ὑπείροχον ἰσχὺν<br /></span>
                    <span>καὶ Χρόνον ἀέναον καὶ τὸ Στυγὸς ἀγλαὸν ὕδωρ<br /></span>
                    <span>μειλιχίους τε θεούς, ἀγαθήν τ' ἐπὶ τοῖσι Πρόνοιαν<br /></span>
                    <span>Δαίμονά τ' ἠγάθεον καὶ Δαίμονα πήμονα θνητῶν,<br /></span>
                    <span>Δαίμονας οὐρανίους καὶ ἠερίους καὶ ἐνύδρους<br /></span>
                    <span>καὶ χθονίους καὶ ὑποχθονίους ἠδ' ἐμπυριφοίτους,<br /></span>
                    <span>καὶ Σεμέλην Βάκχου τε συνευαστῆρας ἅπαντας,<br /></span>
                <span> Ἰνὼ Λευκοθέην τε Παλαίμονά τ' ὀλβιοδώτην<br /></span>
                    <span>Νίκην θ' ἡδυέπειαν ἰδ' Ἀδρήστειαν ἄνασσαν<br /></span>
                    <span>καὶ βασιλῆα μέγαν Ἀσκληπιὸν ἠπιοδώτην<br /></span>
                    <span>Παλλάδα τ' ἐγρεμάχην κούρην, Ἀνέμους τε πρόπαντας<br /></span>
                    <span>καὶ Βροντὰς Κόσμου τε μέρη τετρακίονος αὐδῶ·<br /></span>
                    <span>Μητέρα τ' ἀθανάτων, Ἄττιν καὶ Μῆνα κικλήσκω<br /></span>
                    <span>Οὐρανίαν τε θεάν, σύν τ' ἄμβροτον ἁγνὸν Ἄδωνιν<br /></span>
                <span> Ἀρχήν τ' ἠδὲ Πέρας–τὸ γὰρ ἔπλετο πᾶσι μέγιστον–<br /></span>
                    <span>εὐμενέας ἐλθεῖν κεχαρημένον ἦτορ ἔχοντας<br /></span>
                    <span>τήνδε θυηπολίην ἱερὴν σπονδήν τ' ἐπὶ σεμνήν.<br /></span>
                            `
                </div>
            </div>
        );
    }
}
